const paletteRBW = [
    [255, 255, 255], // Белый
    [0, 0, 0],       // Чёрный
    [255, 0, 0]      // Красный
];

const paletteNES15 = [
    [124, 124, 124], // Серый
    [0, 0, 252],     // Синий
    [0, 0, 188],     // Тёмно-синий
    [68, 40, 188],   // Фиолетовый
    [148, 0, 132],   // Пурпурный
    [168, 0, 32],    // Красный
    [168, 16, 0],    // Тёмно-красный
    [136, 20, 0],    // Коричневый
    [80, 48, 0],     // Тёмно-коричневый
    [0, 120, 0],     // Зелёный
    [0, 104, 0],     // Тёмно-зелёный
    [0, 88, 0],      // Очень тёмно-зелёный
    [0, 64, 88],     // Бирюзовый
    [0, 0, 0],       // Чёрный
    [252, 252, 252]  // Белый
];

const paletteNES54 = [
    [124, 124, 124], // Серый
    [0, 0, 252],     // Синий
    [0, 0, 188],     // Тёмно-синий
    [68, 40, 188],   // Фиолетовый
    [148, 0, 132],   // Пурпурный
    [168, 0, 32],    // Красный
    [168, 16, 0],    // Тёмно-красный
    [136, 20, 0],    // Коричневый
    [80, 48, 0],     // Тёмно-коричневый
    [0, 120, 0],     // Зелёный
    [0, 104, 0],     // Тёмно-зелёный
    [0, 88, 0],      // Очень тёмно-зелёный
    [0, 64, 88],     // Бирюзовый
    [0, 0, 0],       // Чёрный
    [188, 188, 188], // Светло-серый
    [0, 120, 248],   // Голубой
    [0, 88, 248],    // Тёмно-голубой
    [104, 68, 252],  // Светло-фиолетовый
    [216, 0, 204],   // Ярко-пурпурный
    [228, 0, 88],    // Ярко-красный
    [248, 56, 0],    // Оранжевый
    [228, 92, 16],   // Светло-коричневый
    [172, 124, 0],   // Горчичный
    [0, 184, 0],     // Ярко-зелёный
    [0, 168, 0],     // Зелёный
    [0, 168, 68],    // Зелёно-бирюзовый
    [0, 136, 136],   // Голубовато-бирюзовый
    [0, 0, 0],       // Чёрный
    [248, 248, 248], // Белый
    [60, 188, 252],  // Светло-голубой
    [104, 136, 252], // Лавандовый
    [152, 120, 248], // Сиреневый
    [248, 120, 248], // Розовый
    [248, 88, 152],  // Розово-красный
    [248, 120, 88],  // Персиковый
    [252, 160, 68],  // Светло-оранжевый
    [248, 184, 0],   // Жёлтый
    [184, 248, 24],  // Лаймовый
    [88, 216, 84],   // Светло-зелёный
    [88, 248, 152],  // Мятный
    [0, 232, 216],   // Аква
    [120, 120, 120], // Тёмно-серый
    [252, 252, 252], // Чисто-белый
    [164, 228, 252], // Светло-голубой
    [184, 184, 248], // Светло-фиолетовый
    [216, 184, 248], // Лиловый
    [248, 184, 248], // Розовый
    [248, 164, 192], // Бледно-розовый
    [240, 208, 176], // Кремовый
    [252, 224, 168], // Светло-жёлтый
    [248, 216, 120], // Светло-золотистый
    [216, 248, 120], // Лимонный
    [184, 248, 184], // Светло-зелёный
    [184, 248, 216], // Бирюзовый
    [0, 0, 0]        // Чёрный
];

